import streamlit as st
import streamlit as st
from tkinter.tix import COLUMN
from pyparsing import empty



st.title('어데가노?')
st.header('말만 해라 다 알려줄게')


st.write(' ')
st.write(' ')
st.write(' ')
st.write(' ')

st.header('Introduction')
st.write('이 프로젝트는 멀티캠퍼스 데이터분석 및 시각화 과정의 최종 팀 프로젝트입니다. 본 과정에서 배운 다양한 데이터 분석 기법, 기초 통계 기법, 홈페이지 배포 등을 활용하여 "대중교통 이용량 분석을 통한 관광명소 마케팅 정보 분석"이라는 주제로 실제 데이터를 분석하였습니다. 이를 통해 숨은 명소를 발굴하고, 교통 편의성 및 접근성을 향상하기 위한 시티투어버스 노선을 개발하였습니다. 또한 사용자의 니즈에 맞게 여행지 추천시스템을 개발했으며 프로젝트의 궁극적인 목표인 오버투어리즘을 예방하고 극복하고자 합니다.')

st.write(' ')
st.write(' ')
st.write(' ')
st.write(' ')

st.header('WHY')
st.markdown('1. 오버투어리즘 심화')
st.write("코로나19 확산 여파에 3년여 동안 억눌렸던 여행심리가 폭발하며 관광객 추이는 크게 증가하고 있습니다. (자료) 하지만 현상에는 항상 양면성이 존재하듯이 관광객으로 인한 피해도 발생하고 있는데 그중 대표적인 현상으로는 오버투어리즘이 있습니다. “코로나19 엔데믹 이후 관광 수요 급증 등으로 세계 주요 명소마다 오버투어리즘(과잉 관광)으로 몸살을 앓는 가운데, 우리나라 지방자치단체들도 오버투어리즘 대응책 마련에 분주하다.")
st.write(' ')
st.markdown('2. 나만의 명소 여행')
st.write("한국관광공사의 2024 관광트렌드 분석 및 분석보고서에 따르면, 인구 구조의 변화와 SNS의 발달으로 인해 여행객들은 흔히 알려진 관광지보다는 덜 알려진 숨겨진 관광지를 찾는 경향이 있습니다. 이에 따라, 대중교통 이용량을 분석하여 각 지역의 숨겨진 명소를 제안하고 시티투어버스 노선을 개발하면, 여행객을 각 지자체로 분산시켜 더 큰 효과를 기대할 수 있습니다.")
st.write(' ')
st.markdown('3. 남부권 광역관광 개발')
st.write("‘남부권 광역관광 개발계획’은 현 정부의 국정과제에 반영되어 내년부터 시작되는 총 3조 원 규모의 초대형 국책사업으로, 남부권을 수도권에 대응하는 지속 가능하고 경쟁력 있는 대한민국 관광의 중심지로 조성하기 위해 마련되었고 이를 배경으로 남부권 지역으로 초점을 맞추고자 합니다.")